## **[MySQL REPLACE](https://www.mysqltutorial.org/mysql-replace.aspx)**

How to use the MySQL REPLACE statement to insert or update data in database tables

In [1]:
import pandas as pd
import numpy as np
import re
import matplotlib.pyplot as plt
import matplotlib.image as mpimg
from IPython.display import Image, SVG

from sqlalchemy_utils import database_exists, create_database
from sqlalchemy import create_engine, inspect, MetaData, text
from sqlalchemy_schemadisplay import create_schema_graph
import pymysql

pd.set_option(
    'display.max_columns', None,
    'expand_frame_repr', True,
    'display.max_colwidth', None,
    'display.max_rows', 10,
)

pd.set_option('display.width', 65)

In [2]:
# connect to the classicmodels database
connect_args={'ssl':{'fake_flag_to_enable_tls': True}}

engine = create_engine('mysql+pymysql://namlq:abc123@localhost/classicmodels',
                       connect_args=connect_args, echo=False
                         )
inspector = inspect(engine)

### Introduction to MySQL REPLACE statement

### Using MySQL REPLACE to insert a new row

# syntax:
REPLACE [INTO] table_name(column_list)
VALUES(value_list);

In [3]:
engine.execute('DROP TABLE IF EXISTS cities')

# create a new table named cities:
string = '''
CREATE TABLE cities (
    id INT AUTO_INCREMENT PRIMARY KEY,
    name VARCHAR(50),
    population INT NOT NULL)
;'''

engine.execute(string)

# insert some rows into the cities table:
string = '''
INSERT INTO cities(name, population)
VALUES ('New York', 8008278),
        ('Los Angeles', 3694825),
        ('San Diego', 1223405)
;'''

engine.execute(string)

/tmp/ipykernel_7862/1533289517.py:1: RemovedIn20Warning: Deprecated API features detected! These feature(s) are not compatible with SQLAlchemy 2.0. To prevent incompatible upgrades prior to updating applications, ensure requirements files are pinned to "sqlalchemy<2.0". Set environment variable SQLALCHEMY_WARN_20=1 to show all deprecation warnings.  Set environment variable SQLALCHEMY_SILENCE_UBER_WARNING=1 to silence this message. (Background on SQLAlchemy 2.0 at: https://sqlalche.me/e/b8d9)
  engine.execute('DROP TABLE IF EXISTS cities')

In [4]:
# verify the insert operation:
pd.read_sql_table('cities', engine)

   id         name  population
0   1     New York     8008278
1   2  Los Angeles     3694825
2   3    San Diego     1223405

In [5]:
# update the population of the Los Angeles city to 3696820:
string = '''
REPLACE INTO cities (id, population)
VALUES (2, 3696820)
;'''

engine.execute(string)

In [6]:
# verify the replacement:
df1 = pd.read_sql('SELECT * FROM cities', engine)
df1

   id       name  population
0   1   New York     8008278
1   2       None     3696820
2   3  San Diego     1223405

pandas equivalent code:

In [7]:
# create an initial table:
df2 = pd.DataFrame(
    columns=['id', 'name', 'population'])

# columns type of the table:
def change_type(df):
    return df.assign(
        id = range(1, len(df)+1),
        name = df.name.str[:50],
        population = df.population.astype(int))

# insert some rows into the table:
rows = (
    pd.DataFrame.from_dict({
        'name': ['New York', 'Los Angeles', 'San Diego'],
        'population': [8008278, 3694825, 1223405]})
    .pipe(change_type)
)
        
df2 = pd.concat([df2, rows])

# update the population of the Los Angeles city to 3696820:
row = pd.DataFrame.from_dict({
    'id': [2], 'population': [3696820]})

df2 = (pd.concat([df2, row], axis=0)
       .drop_duplicates(subset='id', keep='last')
       .sort_values(by='id', ignore_index=True)
       .pipe(change_type)
      )

df2

   id       name  population
0   1   New York     8008278
1   2        NaN     3696820
2   3  San Diego     1223405

### Using MySQL REPLACE statement to update a row

# syntax:
REPLACE INTO TABLE
SET column1 = value1,
    column2 = value2;

In [8]:
# use REPLACE to update the population of the Phoenix city to 1768980:
string = '''
REPLACE INTO cities
# will use the default value if you not specify the value for the column
SET id = 4,
    name = 'Phoenix',
    population = 1768980
;'''

engine.execute(string)

In [9]:
# verify the updating:
df1 = pd.read_sql('SELECT * FROM cities', engine)
df1

   id       name  population
0   1   New York     8008278
1   2       None     3696820
2   3  San Diego     1223405
3   4    Phoenix     1768980

In [10]:
# equivalent pandas code:
row = pd.DataFrame.from_dict({
    'id': [4], 'name': ['Phoenix'], 'population': [1768980]})

df2 = (
    pd.concat([df2, row])
    .drop_duplicates(subset='id', keep='last')
    .sort_values(by='id', ignore_index=True)
    .pipe(change_type)
)

df2

   id       name  population
0   1   New York     8008278
1   2        NaN     3696820
2   3  San Diego     1223405
3   4    Phoenix     1768980

### Using MySQL REPLACE to insert data from a SELECT statement

# insert data into a table with the data come from a query:
# similar to INSERT INTO SELECT statement
REPLACE INTO table_1(column_list)
SELECT column_list
FROM table_2
WHERE where_condition;

In [11]:
# copy a row within the same table:
string = '''
REPLACE INTO cities(name, population)
SELECT name, population
FROM cities
WHERE id = 1
;'''

engine.execute(string)

In [12]:
# verify the result:
df1 = pd.read_sql('SELECT * FROM cities', engine)
df1

   id       name  population
0   1   New York     8008278
1   2       None     3696820
2   3  San Diego     1223405
3   4    Phoenix     1768980
4   5   New York     8008278

In [13]:
# equivalent pandas code:
df2 = (
    pd.concat([
        df2, df2.query('id == 1')[['name', 'population']]])
    .pipe(change_type)
)

df2

   id       name  population
0   1   New York     8008278
1   2        NaN     3696820
2   3  San Diego     1223405
3   4    Phoenix     1768980
0   5   New York     8008278

In [14]:
# delete unused table:
engine.execute('DROP TABLE IF EXISTS cities')